app/controllers/api/trails_controller.rb

SELECT "trails".* FROM "trails"
---
  def index
    @trails = Trail.all

SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  def select_trail
    Trail.find(params[:id])